Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: PasswordSafe V3.28 and later provide the facility to create and manage Named Password Policies via the "Manage → Password Policies..." menu item.
ru_ru: Начиная с версии 3.28, PasswordSafe позволяет работать с именованными политиками. Создание и управление политиками производится через меню «Сервис→Политики создания паролей...»

source: PasswordSafe doesn't store or use this in any way.
ru_ru: PasswordSafe не сохраняет и не использует его для других целей.

source: Run Cmd: This field can be used to specify a command or program to be run via the 'Run Command' action (via the Edit menu, right-click popup menu or Ctrl-R).
ru_ru: Выполнить: данное поле используется для указания команды/программы, выполняемой при выборе пункта «Выполнить команду» (в меню «Правка» или контекстном меню) или по горячей клавише Ctrl+R.

source: Set maximum number of password saved to above value - All entries will save up to the above number of passwords.
ru_ru: Установить максимальное количество сохраняемых паролей равным указанному значению — все элементы будут хранить указанное количество паролей.

source: Start saving previous passwords - This is the equivalent of setting the "Keep N last passwords" checkbox in all the entries in the database.
ru_ru: Начать сохранять предыдущие пароли — равносильно установке флажка «Хранить N предыдущих паролей» для всех элементов контейнера.

source: Statistics: These read-only fields help keep track of when the selected entry was created, last accessed, etc.
ru_ru: Статистика: поля в этой группе содержат информацию о времени создания, последнего доступа и пр.

source: Stop saving previous passwords - This is the equivalent of clearing the "Keep N lastpasswords" checkbox in all the entries in the database.
ru_ru: Перестать сохранять предыдущие пароли — равносильно снятию флажка «Хранить N предыдущих паролей» для всех элементов контейнера.

source: Title: A friendly name for a password entry
ru_ru: Заголовок: имя, характеризующее данный элемент;

source: URL: The URL associated with the entry.
ru_ru: Ссылка: ссылка, связанная с данным элементом.

source: User name: The user name
ru_ru: Имя: имя пользователя;

source: Warning: Do NOT modify any of the preferences in the pwsafe.cfg file manually, as this may cause unexpected or unpredictable results.
ru_ru: Внимание. Не рекомендуется изменять файл настроек вручную, т. к. это может привести к непредвиденным результатам.

source: \# (Windows only) is exactly the same as \z above except that it toggles using the old AutoType mechanism on/off for the part of the AutoType string between these codes.
ru_ru: \# (только для Windows) работает аналогично «\z», но переключение на старый способ набора происходит только для символов, расположенных между этими этими последовательностями.

source: \\ is replaced by the backslash (\) key.
ru_ru: \\ заменяется обратной косой чертой («\»).

source: \b is replaced by the backspace key.
ru_ru: \b заменяется клавишей «забой».

source: \c (Linux only) generates the key events that cause a platform-specific Select-All command.
ru_ru: \c (только для Linux) генерирует платформно-зависимое клавиатурное событие «Выделить всё».

source: \dNNN sets the delay between characters to NNN milliseconds, instead of 10 (the default).
ru_ru: \dNNN устанавливает задержку между вводом символов в NNN миллисекунд, вместо 10 мс, установленных по умолчанию.

source: \g is replaced by the group associated with the entry.
ru_ru: \g заменяется на группу, соответствующую данному элементу.

source: \i is replaced by the title associated with the entry.
ru_ru: \i заменяется на заголовок данного элемента.

source: \j (Linux only) starts generating independent key events for modifier keys like ALT, SHIFT, etc.
ru_ru: \j (только для Linux) начать генерацию отдельных событий для клавиш-модификаторов (Alt, Shift, и пр.).

source: \j and \k could be useful when you find that autotype is not maintaining case-sensitivity of autotyped text, or is producing the lower keys (3 instead of #).
ru_ru: \j и \k могут быть полезны в случае, если вы заметили, что автонабор не учитывает регистр текста или не вводит символы из «верхнего ряда» (вводит «3» вместо «#»).

source: \k (Linux only) stops generating independent keystrokes for modifier keys and only simulates the modifications (like making things uppercase) with flags to main key events.
ru_ru: \k (только для Linux) завершить генерацию отдельных событий для клавиш-модификаторов и и начать имитировать модификации (например, изменение регистра букв) с помощью флагов для основных клавиатурный событий.

source: \l is replaced by the URL associated with the entry (that's the letter ell, not the digit '1').
ru_ru: \l заменяется на соответствующую данному элементу ссылку (используется латинская буква l, а не единица).

source: \m is replaced by the e-mail associated with the entry.
ru_ru: \m заменяется на E-mail, соответствующий данному элементу.

# is replaced by the enter key, in effect pressing a button.
source: \n is replaced by the enter key, in effect pressing a button.
ru_ru: \n заменяется клавишей ввода и используется для нажатия на кнопку.

source: \o is replaced by the contents of the (possibly multilined) Notes field.
ru_ru: \o заменяется содержимым (возможно многострочным) поля «заметки»:

source: \oNNN is replaced by the contents of the nth line of the Notes field
ru_ru: \oNNN заменяется n-й строкой поля «заметки»:

source: \p is replaced by the password associated with the entry.
ru_ru: \p заменяется на пароль, соответствующий данному элементу.

source: \q is replaced by the last password associated with the entry from the entry's password history as long as this entry's password history is still active.
ru_ru: \q заменяется на пароль, соответствующий последнему элементу из истории паролей.

source: \s is replaced by the "Shift+Tab", in effect back-tabbing to the previous field.
ru_ru: \s заменяется комбинацией «Shift+Tab» и используется для перехода в предыдущее поле.

# is replaced by the Tab key, in effect skipping a field on the website's form.
source: \t is replaced by the Tab key, in effect skipping a field on the website's form.
ru_ru: \t заменяется табуляцией и используется для перехода в следующее поле.

# is replaced by the Tab key, in effect skipping a field.
source: \t is replaced by the Tab key, in effect skipping a field.
ru_ru: \t заменяется табуляцией и используется для перехода в следующее поле.

source: \u is replaced by the username associated with the entry.
ru_ru: \u заменяется на имя пользователя, соответствующее данному элементу.

source: \wNNN or \WNNN introduces a delay of NNN milliseconds for \w, or seconds if \W is used.
ru_ru: \wNNN или \WNNN используется для указания задержки в NNN миллисекунд для «\w», и NNN секунд для «\W».

source: \z (Windows only) invokes the old AutoType mechanism.
ru_ru: \z (только для Windows) использует «старый» механизм автонабора.

source: \z invokes the old AutoType mechanism.
ru_ru: \z использует «старый» механизм автонабора.

source: email: The email address associated with this entry.
ru_ru: E-Mail: адрес электронной почты, связанный с данным элементом.

source: n or n[0]
ru_ru: n или n[0]

source: n[-i] or notes[-i]
ru_ru: n[-i] или notes[-i]

source: n[i] or notes[i]
ru_ru: n[i] или notes[i]

source: It is important that you pick a hard-to-guess master password that you can easily remember.
ru_ru: Очень важно, чтобы вы выбрали сложный для подбора мастер-пароль, который легко сможете запомнить.

source: Note: these symbol lists are not used for either pronounceable or easy-to-read passwords.
ru_ru: Примечание. Эти символы не используются при создании произносимых или удобочитаемых паролей.

source: Password Safe is able to pass arguments to the command such as the entry's username, password, etc., as described here.
ru_ru: Password Safe может передать в качестве аргументов имя пользователя, пароль и содержимое других полей, описанных здесь.

source: Password Safe provides a function, Auto Type, that automates the entering of user name and password into a web form.
ru_ru: В Password Safe есть функция автонабора, которая автоматизирует ввод имени пользователя и пароля в web-формы.

source: Password Safe provides a function, AutoType, that automates the entering of a user name and password into a web form.
ru_ru: В Password Safe есть функция автонабора, которая автоматизирует ввод имени пользователя и пароля в web-формы.

source: Note: the internal "Easy-Vision" symbol list will be used for all Easy-Vision and Pronounceable generated passwords.
ru_ru: Примечание. При создании «Произносимых паролей» и паролей из «Легкоотличимых символов» используется жёстко заданный список символов.

source: Password Safe will automatically erase the oldest databases beyond the number of backups that you specified.
ru_ru: Password Safe автоматически перезапишет старую копию при превышении указанного количества,

source: This is the same as the '-c' option, with the addition that the application is started as minimized.
ru_ru: Параметр аналогичен «-c», но, дополнительно, запуск производится в свёрнутом виде.

source: Note: The file can be any file.
ru_ru: Примечание. Файл может быть любым.

source: Note: This implicitly puts the application in the system tray.
ru_ru: Примечание. в данном случае значок приложения будет помещён в область уведомлений (трей).

source: Note: This will work only on files that were encrypted by invoking pwsafe with the '-e' option (see above).
ru_ru: Примечание. Данный метод применим только к файлам ранее зашифрованным с использованием параметра «-e».

source: Password Safe version 3.06 and later uses TinyXML for parsing the application's configuration file.
ru_ru: Начиная с версии 3.06, Password Safe использует TinyXML для разбора файла конфигурации.

source: Password Safe version 3.29 and later use pugixml for parsing the application's configuration file.
ru_ru: С версии 3.29 для работы с файлом настроек Password Safe использует pugixml.

source: Password Safe version 3.12 and later uses an algorithm created by Tom Van Vleck, Morrie Gasser, and Dan Edwards to generate pronounceable passwords.
ru_ru: Начиная с версии 3.12, Password Safe может создавать произносимые пароли с помощью алгоритма Тома ван Флека (Tom Van Vleck), Морри Гассера (Morrie Gasser), и Дэна Эдвардса (Dan Edwards).

source: <date>yyyy-mm-dd</date>
ru_ru: <date>гггг-ММ-дд</date>

source: Note: only the fields selected by the user are compared, so database could be shown as being identical when they are not due to the corresponding fields not being compared. By default, all fields are compared.
ru_ru: Примечание. Так как сравниваются лишь заданные пользователем поля, два отличающихся контейнера могут быть признаны одинаковыми, если они отличаются лишь в полях, исключённых из сравнения. По умолчанию все поля участвуют в сравнении.

source: Additional Tab
ru_ru: Вкладка «Дополнительно»

source: Basic Tab
ru_ru: Вкладка «Основные»

source: Dates and Times Tab
ru_ru: Вкладка «Дата и время»

source: NNN can be one to three digits (e.g., \o5 for the 5th line, \o45 for the 45th, etc.
ru_ru: NNN может состоять из одной, двух или трёх цифр (например, \o5 для 5-й строки, \o45 для 45-й, и т. д.);

source: pwsafe -d filename
ru_ru: pwsafe -d имя_файла

source: pwsafe -e filename
ru_ru: pwsafe -e имя_файла

source: pwsafe -r [database]
ru_ru: pwsafe -r [контейнер]

source: pwsafe -s [database]
ru_ru: pwsafe -s [контейнер]

source: pwsafe -v database
ru_ru: pwsafe -v контейнер

source: pwsafe database
ru_ru: pwsafe контейнер

source: If you find that AutoType does not work properly on a particular web site, try this code at the beginning of the AutoType command field.
ru_ru: Если вы заметили, что автонабор работает некорректно с каким-то сайтом, попробуйте добавить эту ключевую последовательность в поле автонабора.

source: All codes not listed are copied across as-is.
ru_ru: Все неуказанные коды копируются без изменений.

source: However, this option is strongly discouraged in environments where passers-by can view the monitor.
ru_ru: Строго не рекомендуется использовать данный параметр, если во время работы возможен просмотр экрана посторонними людьми.

source: This option is strongly discouraged in environments where passers-by can view the monitor.
ru_ru: Данный параметр строго не рекомендуется использовать, если во время работы возможен просмотр экрана посторонними людьми.

source: However, \# will be ignored if the \z field has been specified anywhere in the AutoType string..
ru_ru: «\#» игнорируется, если «\z» указана в любой части строки автонабора.

source: and then Paste the password into the desired field.
ru_ru: и затем вставьте пароль из буфера обмена в нужное поле.

source: and then Paste the user name into the desired field.
ru_ru: и затем вставьте имя пользователя из буфера обмена в нужное поле.

source: <namex>yyyy-mm-ddThh:mm:ss</namex>
ru_ru: <namex>гггг-ММ-ддTчч:мм:сс</namex>

source: <none>
ru_ru: <не задано>

source: <none>, which corresponds to Consolas 12pt on Windows
ru_ru: <none>, на Windows соответствует Consolas 12pt

source: <none>, which corresponds to Segoe UI Symbol 10pt on Windows
ru_ru: <none>, на Windows соответствует Segoe UI 10pt

source: <pmtimex> and <rmtimex>
ru_ru: <pmtimex> и <rmtimex>

source: Note: The report may contain sensitive data and care should be taken when selecting the "save to disk" option.
ru_ru: Примечание. Отчёт может содержать важные данные, поэтому возможность сохранения на диск следует использовать с осторожностью.

source: A delimiter to reinstate the “newline” character in a multi-line Notes field and the period (‘.’), if present, in the Title field. The default is ‘»’ [Alt+0187], which may be overridden if needed.
ru_ru: Используется разделитель для замены переносов строк в многострочных заметках и точки («.») в заголовках. По умолчанию используется символ ‘»’ [Alt+0187], но его можно переопределить.

source: Password Expires on:To set a password expiration date, click on the "Set..." button and specify the desired expiration date, either as an absolute date (e.g., "March 17th 2007"), or relative from today (e.g., "30 days from now").
ru_ru: Пароль истекает: для указания даты истечения пароля нажмите кнопку «Задать» и введите желаемую дату в абсолютном (22 декабря 2010) или относительном (через 30 дней) формате.

source: Password Safe can work with a YubiKey device to provide "two factor authentication", that is, protecting your database by both something you know (your "Safe Combination" or master passphrase), and tsomething you have (the YubiKey device).
ru_ru: Password Safe может использовать устройство YubiKey для обеспечения «двуфакторной аутентификации», то есть для того, чтобы ваш контейнер был защищён с помощью того, что вы знаете (мастер-пароль) и того, чем вы владеете (устройство YubiKey).

source: PasswordSafe allows you to define filters, and display only those entries that match a given filter.
ru_ru: Password Safe позволяет определить фильтры и отобразить лишь те элементы, которые удовлетворяют заданным в них условиям.

source: PasswordSafe allows you to define filters, and display only those entries that matches a given filter.
ru_ru: Password Safe позволяет определить фильтры и отобразить лишь те элементы, которые удовлетворяют заданным в них условиям.

source: PasswordSafe shortcut setting does not recognise the difference between the Alt, Ctrl and Shift keys on the left side of the keyboard from those on the right.
ru_ru: Password Safe не различает правые и левые клавиши Ctrl, Alt и Shift.

source: Stop saving previous passwords - This is the equivalent of clearing the "Keep N last passwords" checkbox in all the entries in the database.
ru_ru: Перестать сохранять предыдущие пароли — равносильно снятию флажка «Хранить N предыдущих паролей» во всех элементах контейнера.

source: See Backing Up and Restoring Databases for more information.
ru_ru: Для получения дополнительной информации см. Резервное копирование и восстановление контейнеров.

source: See Changing Master Passwords for more information.
ru_ru: Для получения дополнительной информации см. Изменение мастер-пароля для контейнера.

source: See Searching for more information.
ru_ru: Для получения дополнительной информации см. Поиск указанного текста.

source: See User Names, Passwords, and Groups for more information.
ru_ru: Для получения дополнительной информации см. Имена пользователей, пароли и группы.

source: See Using Auto Type for more information.
ru_ru: Для получения дополнительной информации см. Автонабор.

source: See Using AutoType for more information.
ru_ru: Для получения дополнительной информации см. Автонабор.

source: See also Exporting Entries for more information.
ru_ru: Для получения дополнительной информации см. Экспорт элементов.

source: See Using Run Command for more information.
ru_ru: Для получения дополнительной информации см. Выполнение команд.

source: Upon Startup, PasswordSafe searches for a file named autoload_filters.xml in the same directory as the pwsafe.cfg file (by default the directory where PasswordSafe is installed).
ru_ru: При старте Password Safe проверяет наличие файла autoload_filters.xml в каталоге с файлом настроек pwsafe.cfg (по умолчанию это каталог, в который был установлен Password Safe).

source: Many of the setting are stored as preferences, as described here.
ru_ru: Особенности сохранения настроек описаны здесь.

source: Notes:
ru_ru: Примечания:

source: This will validate the database after the correct passphrase is entered, correcting internal inconsistencies as necessary.
ru_ru: После ввода пароля будет проведена проверка на наличие несоответствий.

source: Please DO NOT use this function unless you understand and accept the risks.
ru_ru: Пожалуйста, НЕ ИСПОЛЬЗУЙТЕ данную функцию если вы не до конца осознаёте возможные риски.

source: <time>hh:mm:ss</time>
ru_ru: <time>чч:мм:сс</time>

source: Notes: 1
ru_ru: Примечание 1.

source: Notes: 2
ru_ru: Примечания: 2

source: Notes: 3
ru_ru: Примечания: 3

source: Notes: 4
ru_ru: Примечания: 4

source: The recommended import of KeePass V1 database entries is via XML as described below.
ru_ru: Рекомендуемый способ импорта контейнеров KeePass V1 через XML-файл описан ниже.

source: The recommended import of KeePass V2 database entries is via XML as described below.
ru_ru: Рекомендуемый способ импорта контейнеров KeePass V2 через XML-файл описан ниже.

source: or
ru_ru: или

source: <url> or <runcommand>
ru_ru: <url> или <runcommand>

source: <xtimex> if <Times>/<Expires> is 'True'
ru_ru: <xtimex>, если <Times>/<Expires> равно «True»

source: <xtimex>, if the KeePass <expiretime> attribute "expires" is 'true'
ru_ru: <xtimex>, если в KeePass значение атрибута "expires" тега <expiretime> равно «true»

source: A "filter" is a criteria (or set of criteria) that an entry either matches or doesn't match.
ru_ru: Фильтр — это условие или набор условий, которым удовлетворяет или не удовлетворяет элемент.

source: A Title Row as the first record in the text file.
ru_ru: Первая строка содержит заголовки.

source: A Word About Master Passwords
ru_ru: Несколько слов о мастер-пароле

source: A Word about Master Passwords
ru_ru: Несколько слов о мастер-пароле

source: A back-slash does not have to be escaped unless it precedes a '$' indicating a following variable.
ru_ru: Символ «\» не нужно экранировать, если он не идёт перед символом «$».

source: A database that's open for reading and writing (the default) can be protected against unintended changes by selecting the Change to R-O entry.
ru_ru: Чтобы защитить контейнера, открытый в режиме «чтение/запись» (по умолчанию), от случайных изменений, выберите пункт меню Переключить в режим только чтение (R-O).

source: A delimiter to reinstate the 'newline' character in a multi-line Notes field and the period ('.'), if present, in the Title field.
ru_ru: Для замены переносов строк в многострочных заметках и точки («.») в заголовках используется разделитель.

source: A group cannot be renamed to multiple groups through the Rename Group menu item or shortcut, i.e., group "a" cannot be renamed to "x.y".
ru_ru: При использовании пункта меню Переименовать группу или горячей клавиши невозможно переименовать группу так, чтобы получилось несколько вложенных групп (например, группа не может быть переименована в «x.y»).

source: A list of currently in use entry keyboard shortcuts will be displayed below the Password Safe program related menu shortcuts on the OptionsShortcuts tab via "Manage → Options → Shortcuts".
ru_ru: Список используемых в Password Safe комбинаций клавиш для элементов отображается под списком горячих клавиш для пунктов меню на вкладке Сервис→Настройки→Комбинации клавиш.

source: A list of the Toolbar buttons and their order as customised by the user.
ru_ru: Перечень и порядок кнопок, отображаемых на панели инструментов.

source: A new feature allows two entries to be selected and compared either via the Edit menu or by right-clicking on either.
ru_ru: Новая функция: позволяет выделять и сравнивать два элемента через меню «Правка» или контекстное меню элемента.

source: A password policy describes the rules that are used to create a password - the letters, letter cases, length, and any special characters that are required.
ru_ru: Политика паролей описывает правила, используемые при создании паролей: буквы, их регистр, длина паролей и использование спецсимволов.

source: A password policy describes the rules that are used to create a password—the letters, letter cases, length, and any special characters that are required.
ru_ru: Политика паролей описывает правила, используемые при создании паролей: буквы, их регистр, длина паролей и использование спецсимволов.

source: A password prompt will be displayed.
ru_ru: Будет запрошен пароль для контейнера.

source: A popup menu will appear, allowing you to do so.
ru_ru: В отображённом контекстном меню можно будет выбрать требуемое действие.

source: A protected entry cannot be modified until it is unprotected.
ru_ru: Защищённый элемент не может быть изменён.

source: A protected entry in the current database cannot be included in any multiple selection as it cannot be changed.
ru_ru: Защищённый элемент не может быть выделен вместе с остальными, т. к. он не может быть изменён.

source: A report of the actions taken will be available on completion and this may be copied to the clipboard or saved to disk as a text file in the same directory as the database.
ru_ru: По окончании будет создан отчёт, содержимое которого может быть скопировано в буфер обмена или сохранено на диск в том же каталоге, где находится контейнер.

source: A sample file, which may be modified for your own needs, is supplied as part of the distribution.
ru_ru: Файл, идущий в комплекте с Password Safe, является примером оформления и может быть изменён под ваши нужды.

source: A separator is shown as a ~
ru_ru: В качестве разделителя используется символ «~»

source: A shortcut has a distinct icon associated with it, , and by default has the name "shortcut to x", where x is the title of the original entry.
ru_ru: Для отображения ярлыков используется другой значок () и, по умолчанию, имя имеет вид «ярлык для x», где x — имя исходного элемента.

source: A single Master Password unlocks them all for your use.
ru_ru: Для доступа к ним вам необходимо запомнить лишь один мастер-пароль.

source: A toolbar appears above the status bar at the bottom of the application's windows similar to the following:
ru_ru: Над строкой состояния появится панель поиска, похожая на ту, что изображена на рисунке.
